Vlad/app/controllers/posts_controller.rb

  def catalog
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?